Tekla Open API Reference for Tekla Structures 2025
Reinforcement.EndPointOffsetValue Property
 Gets or sets the concrete cover thickness or leg length at the second end of the bar.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double EndPointOffsetValue { get; set; }
Public Property EndPointOffsetValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace